skywa04885/STM32F446_ENC28J60_FuckYou/Src/internet/microchip/enc28j60_registers.h
#ifndef _SRC_INTERNET_MICROCHIP_ENC28J60_REGISTERS_H
#define _SRC_INTERNET_MICROCHIP_ENC28J60_REGISTERS_H

/*********************************************
 * ENC28J60 Bank 0 Registers
 *********************************************/

#define ENC28J60_BK0_EWRPTL			0x02
#define ENC28J60_BK0_EWRPTH			0x03

#define ENC28J60_BK0_ETXSTL			0x04
#define ENC28J60_BK0_ETXSTH			0x05

#define ENC28J60_BK0_ETXNDL			0x06
#define ENC28J60_BK0_ETXNDH			0x07

#define ENC28J60_BK0_ERXSTL			0x08
#define ENC28J60_BK0_ERXSTH			0x09

#define ENC28J60_BK0_ERXNDL			0x0A
#define ENC28J60_BK0_ERXNDH			0x0B

#define ENC28J60_BK0_ERXRDPTL		0x0C
#define ENC28J60_BK0_ERXRDPTH		0x0D

#define ENC28J60_BK0_ERXWRPTL		0x0E
#define ENC28J60_BK0_ERXWRPTH		0x0F

/*********************************************
 * ENC28J60 Bank 2 Registers
 *********************************************/

#define ENC28J60_BK2_MACON1			0x00
#define ENC28J60_BK2_MACON1_MARXEN	0
#define ENC28J60_BK2_MACON1_PASSALL	1
#define ENC28J60_BK2_MACON1_RXPAUS	2
#define ENC28J60_BK2_MACON1_TXPAUS	3

#define ENC28J60_BK2_MACON3			0x02
#define ENC28J60_BK2_MACON3_FULDPX	0
#define ENC28J60_BK2_MACON3_FRMLNEN	1
#define ENC28J60_BK2_MACON3_HFRMEN	2
#define ENC28J60_BK2_MACON3_PHDREN	3
#define ENC28J60_BK2_MACON3_TXCRCEN	4

#define ENC28J60_BK2_MACON3_PADCFG(A) \
	(((A) & 0x7) << 5)

#define ENC28J60_BK2_MACON4			0x03
#define ENC28J60_BK2_MACON4_NOBKOFF	4
#define ENC28J60_BK2_MACON4_BPEN	5
#define ENC28J60_BK2_MACON4_DEFER	6

#define ENC28J60_BK2_MICMD			0x12
#define ENC28J60_BK2_MICMD_MIIRD	0
#define ENC28J60_BK2_MICMD_MIISCAN	1

#define ENC28J60_BK2_MIREGADR		0x14

#define ENC28J60_BK2_MIWRL			0x16
#define ENC28J60_BK2_MIWRH			0x17

#define ENC28J60_BK2_MIRDL			0x18
#define ENC28J60_BK2_MIRDH			0x19

#define ENC28J60_BK2_MAMXFLL		0x0A
#define ENC28J60_BK2_MAMXFLH		0x0B

#define ENC28J60_BK2_MABBIPG		0x04

#define ENC28J60_BK2_MAIPGL			0x06
#define ENC28J60_BK2_MAIPGH			0x07

/*********************************************
 * ENC28J60 Bank 3 Registers
 *********************************************/

#define ENC28J60_BK3_MAADR5			0x00
#define ENC28J60_BK3_MAADR6			0x01
#define ENC28J60_BK3_MAADR3			0x02
#define ENC28J60_BK3_MAADR4			0x03
#define ENC28J60_BK3_MAADR1			0x04
#define ENC28J60_BK3_MAADR2			0x05

#define ENC28J60_BK3_MISTAT			0x0A
#define ENC28J60_BK3_MISTAT_BUSY	0
#define ENC28J60_BK3_MISTAT_SCAN	1
#define ENC28J60_BK3_MISTAT_NVALID	2

/*********************************************
 * ENC28J60 NON-BANK Registers
 *********************************************/

#define ENC28J60_ECON1				0x1F

#define ENC28J60_ECON1_TXRST		7
#define ENC28J60_ECON1_RXRST		6
#define ENC28J60_ECON1_DMAST		5
#define ENC28J60_ECON1_CSUMEN		4
#define ENC28J60_ECON1_TXRTS		3
#define ENC28J60_ECON1_RXEN			2
#define ENC28J60_ECON1_BSEL_SHIFT	0

#define ENC28J60_ECON2				0x1E

#define ENC28J60_ECON2_AUTOINC		7
#define ENC28J60_ECON2_PKTDEC		6
#define ENC28J60_ECON2_PWRSV		5
#define ENC28J60_ECON2_VRPS			3

#define ENC28J60_ESTAT				0x1D

#define ENC28J60_ESTAT_INT			7
#define ENC28J60_ESTAT_BUFFER		6
#define ENC28J60_ESTAT_LATECOL		4
#define ENC28J60_ESTAT_RXBUSY		2
#define ENC28J60_ESTAT_TXABRT		1
#define ENC28J60_ESTAT_CLKRDY		0

#define ENC28J60_EIR				0x1C

#define ENC28J60_EIR_PKTIF			6
#define ENC28J60_EIR_DMAIF			5
#define ENC28J60_EIR_LINKIF			4
#define ENC28J60_EIR_TXIF			3
#define ENC28J60_EIR_TXERIF			1
#define ENC28J60_EIR_RXERIF			0

#define ENC28J60_EIE				0x1B

#define ENC28J60_EIE_INTIE			7
#define ENC28J60_EIE_PKTIE			6
#define ENC28J60_EIE_DMAIE			5
#define ENC28J60_EIE_LINKIE			4
#define ENC28J60_EIE_TXIE			3
#define ENC28J60_EIE_TXERIE			1
#define ENC28J60_EIE_RXERIE			0

/*********************************************
 * ENC28J60 PHY Registers
 *********************************************/

#define ENC28J60_PHCON1				0x00
#define ENC28J60_PHCON1_PRST		15
#define ENC28J60_PHCON1_PLOOPBK		14
#define ENC28J60_PHCON1_PPWRSV		11
#define ENC28J60_PHCON1_PDPXMD		8

#define ENC28J60_PHSTAT1			0x01
#define ENC28J60_PHSTAT1_PFDPX		12
#define ENC28J60_PHSTAT1_PHDPX		11
#define ENC28J60_PHSTAT1_LLSTAT		2
#define ENC28J60_PHSTAT1_JBSTAT		1

#define ENC28J60_PHID1				0x02
#define ENC28J60_PHID2				0x03

#define ENC28J60_PHCON2				0x10
#define ENC28J60_PHCON2_FRCLNK		14
#define ENC28J60_PHCON2_TXDIS		13
#define ENC28J60_PHCON2_JABBER		10
#define ENC28J60_PHCON2_HDLDIS		8

#define ENC28J60_PHSTAT2			0x11
#define ENC28J60_PHSTAT2_TXSTAT		13
#define ENC28J60_PHSTAT2_RXSTAT		12
#define ENC28J60_PHSTAT2_COLSTAT	11
#define ENC28J60_PHSTAT2_LSTAT		10
#define ENC28J60_PHSTAT2_DPXSTAT	9
#define ENC28J60_PHSTAT2_PLRITY		5

#define ENC28J60_PHIE				0x12
#define ENC28J60_PHIR				0x13

#define ENC28J60_PHLCON				0x14
#define ENC28J60_PHLCON_STRCH		1
#define ENC28J60_PHLCON_LACFG(A) \
	(((A) & 0xF) << 8)
#define ENC28J60_PHLCON_LBCFG(A) \
	(((A) & 0xF) << 4)
#define ENC28J60_PHLCON_LFRQ(A) \
	(((A) & 0x3) << 2)

typedef enum
{
	ENC28J60_PHLCON_LCFG_DISPLAY_TX_ACTIVITY = 0b0001,
	ENC28J60_PHLCON_LCFG_DISPLAY_RX_ACTIVITY,
	ENC28J60_PHLCON_LCFG_DISPLAY_COL_ACTIVITY,
	ENC28J60_PHLCON_LCFG_DISPLAY_LINK_STATUS,
	ENC28J60_PHLCON_LCFG_DISPLAY_DUPLEX_STATUS,
	ENC28J60_PHLCON_LCFG_DISPLAY_RX_TX_ACTIVITY = 0b0111,
	ENC28J60_PHLCON_LCFG_ON,
	ENC28J60_PHLCON_LCFG_OFF,
	ENC28J60_PHLCON_LCFG_BLINK_FAST,
	ENC28J60_PHLCON_LCFG_BLINK_SLOW,
	ENC28J60_PHLCON_LCFG_DISPLAY_LINK_STATUS_AND_RX_ACTIVITY,
	ENC28J60_PHLCON_LCFG_DISPLAY_LINK_STATUS_AND_RX_TX_ACTIVITY,
	ENC28J60_PHLCON_LCFG_DISPLAY_DUPLEX_STATUS_AND_COL_ACTIVITY
} enc28j60_phlcon_lcfg_t;

typedef enum
{
	ENC28J60_PHLCON_LFRQ_NSTRCH = 0b00,
	ENC28J60_PHLCON_LFRQ_MSTRCH,
	ENC28J60_PHLCON_LFRQ_LSTRCH
} enc28j60_phlcon_lfrq_t;

#endif
